rm(list=ls())
# 9장 연습문제제

# 1번

x_1 <- c(87.9, 89.9, 153.0, 132.2, 88.8, 220.9, 117.7, 109.0, 156.1, 181.5, 181.4)
x_2 <- c(19.6, 15.2, 19.7, 17.0, 18.3, 17.8, 17.8, 18.3, 17.8, 16.8, 17.0)
x_3 <- c(1.0, 90.1, 56.6, 91.0, 93.7, 106.9, 65.5, 41.8, 57.4, 140.6, 74.3)
x_4 <- c(1661, 968, 1353, 1293, 1153, 1286, 1104, 1574, 1222, 902, 1150)
x_5 <- c(28.37, 23.77, 26.04, 25.74, 26.68, 24.29, 28.00, 28.37, 24.96, 21.66, 24.37)

data <- cbind(x_1, x_2, x_3, x_4, x_5)

## (a)
### 평균벡터
colMeans(data)
### 공분산 행렬
cov(data)
### 상관행렬
cor(data)

## (b)
### 공분산 행렬을 이용한 주성분 분석
data.pca<- prcomp(data[,1:4], center = T, scale=F)
print(data.pca)
summary(data.pca)
plot(data.pca, type="l")

## (c)
### 상관행렬을 이용한 주성분 분석
data.pca2<- prcomp(data[,1:4], center = T, scale=T)
print(data.pca2)
summary(data.pca2)
plot(data.pca2, type="l")

## (d)
# 관측값의 측정 단위가 다르므로 상관행렬을 이용한 주성분분석이 더 유의미한 결과를 가진다.


# 2번

s <- matrix(c(302.3, 125.8, 100.4, 105.1, 116.1,
              125.6, 170.9, 84.2, 93.6, 97.9,
              100.4, 84.2, 111.6, 110.8, 120.5,
              105.1, 93.6, 110.8, 217.9, 153.8,
              116.1, 97.9, 120.5, 153.8, 294.4),5,5,byrow=T)

v <- eigen(s)$vectors
std <- sqrt(eigen(s)$values)

values <- eigen(s)$values
var <- rep(0, 5)
for(i in 1:5){
  var[i] <- values[i] / sum(values)
}
cumsum(var)

# 주성분 분석 결과를 본 결과 