rm(list=ls())

# 10장 연습문제

# 1번
## 데이터 설정
install.packages("GPArotation")
library(GPArotation)
library(psych)
s <- matrix(c(302.3, 125.8, 100.4, 105.1, 116.1,
              125.6, 170.9, 84.2, 93.6, 97.9,
              100.4, 84.2, 111.6, 110.8, 120.5,
              105.1, 93.6, 110.8, 217.9, 153.8,
              116.1, 97.9, 120.5, 153.8, 294.4),5,5,byrow=T)
s

## 인자분석
EFA <- fa(r=cov2cor(s), nfactors = 2, rotate = "oblimin", fm="pa")
EFA
# 인자부하를 살펴보면 Mechanics, Vector은 모두 제 2인자에 0.7 근방의 높은 인자부하를 가지고 있다
# Algebra, Analysis, Statistics은 제 1인자에 0.7이상의 높은 인자부하를 가진다
# 두 인자는 각 분산의 0.41%, 0.36%를 설명하며, 전체분산의 0.78%를 설명한다.
# 그리고 두 인자는 강한 상관관계(0.76)을 가진다.

## 인자분석의 부하행렬
EFA$loadings
load <- EFA$loadings[,1:2]
plot(load, type="n")
text(load, labels=c("Mechanics", "Vector", "Algebra", "Analysis", "Statistics"), cex=0.7)

factor.plot(EFA, cut=0.5)
fa.diagram(EFA)


# 2번

M <- diag(rep(1,15))
m <- c(0.24,
       0.04,0.12,
       0.31,0.38,0,
       0.09,0.43,0,0.3,
       0.23,0.37,0.08,0.48,0.81,
       -0.11,0.35,-0.03,0.65,0.41,0.36,
       0.27,0.48,0.05,0.35,0.82,0.83,0.23,
       0.55,0.14,0.27,0.14,0.02,0.15,-0.16,0.23,
       0.35,0.34,0.09,0.39,0.70,0.70,0.28,0.81,0.34,
       0.28,0.55,0.04,0.35,0.84,0.76,0.21,0.86,0.20,0.78,
       0.34,0.51,0.20,0.50,0.72,0.88,0.39,0.77,0.30,0.71,0.78,
       0.37,0.51,0.29,0.61,0.67,0.78,0.42,0.73,0.35,0.79,0.77,0.88,
       0.47,0.28,-0.32,0.69,0.48,0.53,0.45,0.55,0.21,0.61,0.55,0.55,0.54,
       0.59,0.38,0.14,0.33,0.25,0.42,0.00,0.55,0.69,0.62,0.43,0.53,0.57,0.40)

M[upper.tri(M, diag=F)] <- m
M[lower.tri(M, diag=F)] <- t(M)[lower.tri(M, diag=F)]
colnames(M) <- c("지원서", "용모", "학업능력", "호감도", "자신감",
                 "명료성", "정직성", "판매기술", "경험", "운전경력",
                 "야망", "이해력", "잠재력", "참여열정", "적합성")
rownames(M) <- colnames(M)
M

install.packages("nFactors")
library(nFactors)
ev <- eigen(M)
ap <- parallel(subject=48, var=15)
VSS.scree(M) # 인자의 수=4

EFA <- fa(r=M, nfactors=4, rotate="oblimin", fm="pa")
EFA
fa.diagram(EFA)
# 인자부라를 살펴보면(자신감, 야망, 판매기술, 명료성, 이해력, 운전경력, 잠재력, 용모)는 제 1인자 
# (경험, 적합성, 지원서)는 제 2인자
# (호감도, 정직성)은 제 3인자
# (학업능력, 참여일정)은 제 4인자에 높은 인자 부하를 가진다
# 4개의 인자는 각각 분산의 37%, 16%, 15%, 7% 총 75% 정도를 설명한다
# 제 4인자를 제외하고 나머지 인자들은 서로 어느정도 상관관계를 가지고 있다.




